{
  "filename": "contributor.md",
  "__html": "<p>You can report a bug, submit a new function enhancement suggestion, or submit a pull request directly.</p>\n<h2>Submit an Issue</h2>\n<ul>\n<li>Before submitting an issue, please go through a comprehensive search to make sure the problem cannot be solved just by searching.</li>\n<li>Check the <a href=\"https://github.com/dromara/soul/issues\">Issue List</a> to make sure the problem is not repeated.</li>\n<li><a href=\"https://github.com/dromara/soul/issues/new/choose\">Create</a> a new issue and choose the type of issue.</li>\n<li>Define the issue with a clear and descriptive title.</li>\n<li>Fill in necessary information according to the template.</li>\n<li>Choose a label after issue created, for example: bug，enhancement，discussion.</li>\n<li>Please pay attention for your issue, you may need provide more information during discussion.</li>\n</ul>\n<h2>Developer Flow</h2>\n<p><strong>Fork Soul repo</strong></p>\n<ul>\n<li>Fork a <code>Soul</code> repo to your own repo to work, then setting upstream.</li>\n</ul>\n<pre><code class=\"language-shell\">git remote add upstream https://github.com/dromara/soul.git\n</code></pre>\n<p><strong>Choose Issue</strong></p>\n<ul>\n<li>Please choose the issue to be edited. If it is a new issue discovered or a new function enhancement to offer, please create an issue and set the right label for it.</li>\n<li>After choosing the relevant issue, please reply with a deadline to indicate that you are working on it.</li>\n</ul>\n<p><strong>Create Branch</strong></p>\n<ul>\n<li>Switch to forked master branch, pull codes from upstream, then create a new branch.</li>\n</ul>\n<pre><code class=\"language-shell\">git checkout master\ngit pull upstream master\ngit checkout -b issueNo\n</code></pre>\n<p><strong>Notice</strong> ：We will merge PR using squash, commit log will be different form upstream if you use old branch.</p>\n<p><strong>Coding</strong></p>\n<ul>\n<li>Please obey the <a href=\"/en/contribute/code-conduct/\">Code of Conduct</a> during the process of development and finish the check before submitting the pull request.</li>\n<li>push code to your fork repo.</li>\n</ul>\n<pre><code class=\"language-shell\">git add modified-file-names\ngit commit -m 'commit log'\ngit push origin issueNo\n</code></pre>\n<p><strong>Submit Pull Request</strong></p>\n<ul>\n<li>Send a pull request to the master branch.</li>\n<li>The mentor will do code review before discussing some details (including the design, the implementation and the performance) with you. The request will be merged into the branch of current development version after the edit is well enough.</li>\n<li>At last, congratulate to be an official contributor of Soul.</li>\n</ul>\n<p><strong>Delete Branch</strong></p>\n<ul>\n<li>You can delete the remote branch (origin/issueNo) and the local branch (issueNo) associated with the remote branch (origin/issueNo) after the mentor merged the pull request into the master branch of Soul.</li>\n</ul>\n<pre><code class=\"language-shell\">git checkout master\ngit branch -d issueNo\ngit push origin --delete issueNo\n</code></pre>\n<p><strong>Notice</strong>:  Please note that in order to show your id in the contributor list, don't forget the configurations below:</p>\n<pre><code class=\"language-shell\">git config --global user.name \"username\"\ngit config --global user.email \"username@mail.com\"\n</code></pre>\n<p><strong>FAQ</strong></p>\n<ul>\n<li>After each Pull Request (PR), you need to execute the following operations, otherwise, the previous PR commit records will be mixed with this PR commit records. The specific operation process is as follows:</li>\n</ul>\n<pre><code class=\"language-shell\">git checkout master\ngit fetch upstream\ngit reset --hard upstream/master\ngit push -f\n</code></pre>\n",
  "link": "/en-us/docs/soul/contributor.html",
  "meta": {
    "title": "soul-contributor",
    "keywords": "soul-contributor",
    "description": "Soul Contributor's Guide"
  }
}